package cx.fam.tak0294.game;

public class TaskIterator
{
	private TaskList tList;
	private Task t;
	
	//==============================================================
	//	コンストラクタ.
	//==============================================================
	public TaskIterator(TaskList tList)
	{
		this.tList = tList;
		this.t	    = tList.activeDummyTask;
	}
	
	//==============================================================
	//	次のタスクがあるか調べる関数.
	//==============================================================
	public boolean  hasNext()
	{
		return t.getNext() != tList.activeDummyTask;
	}
	
	//==============================================================
	//	前のタスクがあるか調べる関数.
	//==============================================================
	public boolean hasPrev()
	{
		return t.getPrev() != tList.activeDummyTask;
	}
	
	//==============================================================
	//	次のタスクを取得する関数.
	//==============================================================
	public Task next()
	{
		return this.t = this.t.getNext();
	}
	
	//==============================================================
	//	前のタスクを取得する関数.
	//==============================================================
	public Task prev()
	{
		return this.t = this.t.getPrev();
	}
	
	//==============================================================
	//	直前に返したタスクを削除する関数.
	//==============================================================
	public void remove()
	{
		this.t = this.t.getPrev();
		this.tList.deleteTask(this.t.getNext());
	}

}
